project.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>LCCH Project</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="LCCH Project"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-02 18:02:11 EET"/>
<meta name="author" content="Christoph Finkensiep"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">LCCH Project</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Ideas</a>
<ul>
<li><a href="#sec-1-1">1.1 "Concepts"</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Examples of concepts in music</a></li>
<li><a href="#sec-1-1-2">1.1.2 Example of conceptual music</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Concept generation</a></li>
<li><a href="#sec-1-3">1.3 Concept usage</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Forms of material creation</a></li>
<li><a href="#sec-1-3-2">1.3.2 Uses cases</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Open questions</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Implementation</a>
<ul>
<li><a href="#sec-2-1">2.1 Ideas</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 concept language</a></li>
<li><a href="#sec-2-1-2">2.1.2 The "brain"</a></li>
<li><a href="#sec-2-1-3">2.1.3 technical stuff</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Goals</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ideas</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> "Concepts"</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>creativity usually guided by "concepts" on different levels
</li>
<li>possible bridge between randomness and determinism
</li>
<li>resembles the overall "plan" as well as a simple "idea"
</li>
<li>concepts can be statements using other concepts (e.g. a scale is a list of notes)
</li>
<li>terms:
<dl>
<dt>concept</dt><dd>pattern, rule, idea
<ul>
<li>used as scaffold or template
</li>
</ul>

</dd>
<dt>meta-concept</dt><dd>a pattern of concepts
<ul>
<li>instances of meta-concepts are concepts again (e.g. a major scale is a scale)
</li>
<li>in fact no difference to concept, every concept is a meta-concept.
</li>
<li>instance that is no concept (can not be further instantiated) is the final piece.
</li>
</ul>

</dd>
</dl>

</li>
</ul>



</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Examples of concepts in music</h4>
<div class="outline-text-4" id="text-1-1-1">

<ul>
<li>note (duration, pitch, etc)
</li>
<li>rhythm 
</li>
<li>motif
</li>
<li>intervals
</li>
<li>scales
</li>
<li>Sonata form
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Example of conceptual music</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li>a composer writes a
<ul>
<li>melody
</li>
<li>in A-A-B form, consisting of 8+8+8 bars
</li>
<li>in 4/4
</li>
<li>in C major (for simplicity between c' and c'')
</li>
<li>consisting of only quarter notes
</li>
</ul>

</li>
<li>necessary <i>technical</i> concepts:
<dl>
<dt>melody</dt><dd>sequence of <b>notes</b>
</dd>
<dt>A-A-B form</dt><dd>2 melody parts (<b>melody</b>), where the first one is repeated
</dd>
<dt>bar</dt><dd>time period containing being an integer multiple of some <b>note value</b>
</dd>
<dt>4/4</dt><dd>an specific parameter for a <b>bar</b>, consisting of 4 <b>quarter notes</b>
</dd>
<dt>quarter note</dt><dd>a <b>note value</b>, being 1/4 of a whole note
</dd>
<dt>C major</dt><dd>(here:) the ordered set of <b>note heights</b>: {c',d',e',f',g',a',h',c''}
</dd>
<dt>note</dt><dd>consists of a <b>note height</b> and a <b>note value</b>
</dd>
<dt>note height</dt><dd>basic concept, refers to the actual frequency of the played sound
</dd>
<dt>note value</dt><dd>basic concept, a relative time value, together with a tempo results in the note's duration
</dd>
</dl>

</li>
<li>necessary <i>creative</i> concepts:
<ul>
<li>one or more ideas which can be
<ul>
<li>concrete parts of music (here only melodies), e.g. a motif or theme
</li>
<li>concepts combining these (e.g. by repetition)
</li>
<li>further constraints given by instantiating existing concepts
      (in fact, the chosen set of technical concepts belongs to this group,
      so the used technical concepts are actually creative concepts)
</li>
</ul>

</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Concept generation</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>extraction from input:
<ul>
<li>source: 
<ul>
<li>given by the user
</li>
<li>given by other programs / instances of this program
</li>
<li>created randomly
</li>
</ul>

</li>
<li>strategy:
<ol>
<li>try to fit the input into existing concepts
</li>
<li>find group concepts and find abstractions (meta-concepts)
</li>
</ol>

</li>
</ul>

</li>
<li>automatic generation:
  to be done
</li>
<li>exchange with other instances:
  somewhat similar to the input based strategy
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Concept usage</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>the concept database is used to generate material
</li>
<li>concept engine used as library
</li>
</ul>



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Forms of material creation</h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li>as a "stream of ideas"
<ul>
<li>continuously generates material randomly from the concepts.
</li>
<li>simple, fast decisions
</li>
<li>useful for live use cases, improvising
</li>
</ul>

</li>
<li>in a constructive way:
<ul>
<li>material is a single instance of one meta-concept (e.g. a symphony), generated as a whole
</li>
<li>material is generated from high-level meta-concepts and repeatedly refined
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Uses cases</h4>
<div class="outline-text-4" id="text-1-3-2">

<ul>
<li>live performance/improvisation:
  The program gets/generates some initial input and starts to improvise.
  The user can give additional input at runtime to influence the improvisation
<ul>
<li>variant: together with other instances
</li>
</ul>

</li>
<li>offline composition, with/without initial input
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Open questions</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>can concepts be extended to contain general (logical) knowledge?
</li>
<li>how can actions be derived from concepts?
</li>
<li>model of concepts? (-&gt; Implementation)
</li>
<li>what about David Cohen?
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Implementation</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Ideas</h3>
<div class="outline-text-3" id="text-2-1">


<ul>
<li>language:
<ul>
<li>Common Lisp
</li>
</ul>

</li>
<li>pattern extraction:
<ol>
<li>'parse' input
<ul>
<li>e.g. two quarter notes c become <code>&lt;c,4&gt; &lt;c,4&gt;</code>
</li>
</ul>

</li>
<li>abstract step by step:
<dl>
<dt>parametric form</dt><dd>replace parameters by variables, identical parameters (meaning and value) become identical variables
<ul>
<li>e.g. <code>&lt;c,4&gt; &lt;c,4&gt;</code> -&gt; <code>&lt;H,L&gt; &lt;H,L&gt;</code>
</li>
</ul>

</dd>
<dt>structural form</dt><dd>remove 'types', the <i>structure</i> is left
<ul>
<li>e.g. <code>&lt;H,L&gt; &lt;H,L&gt;</code> -&gt; <code>X X</code>
</li>
</ul>

</dd>
<dt><del>relative form</del></dt><dd>relations between entities are taken into account
<ul>
<li>e.g. <code>&lt;c,2&gt; &lt;c,4&gt;</code> -&gt; <code>&lt;H,L&gt; &lt;H,half(L)&gt;</code>
</li>
</ul>

</dd>
<dt>constrainted form</dt><dd>variable are constrainted, can express relative form
<ul>
<li>e.g. <code>X1 X2 X3 : cmaj(X1) cmaj(X2) cmaj(X3)</code> -&gt; 3 notes from c-major scale
</li>
<li>e.g. <code>&lt;H,L1&gt; &lt;H,L2&gt; : double_length(L1,L2)</code> (see ex. for relative form)
</li>
</ul>

</dd>
<dt>semantic abstraction (?)</dt><dd>this is difficult. Find some abstraction or generalisation of the structural form e.g.
<ul>
<li><code>X X</code> -&gt; "<i>repeat X N times</i>"
</li>
</ul>

</dd>
</dl>

</li>
</ol>

</li>
</ul>



</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> concept language</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>not turing complete (first)
</li>
<li>only discrete values
</li>
<li>built in value sets and relations
<ul>
<li>scale / range? (chromatic, diatonic, pentatonic, etc.)
</li>
<li>intervals?
</li>
<li>scales? (in terms of sets / successor relations)
</li>
</ul>

</li>
<li>operators
</li>
<li><del>only structure!</del>
</li>
<li>proposed rules:
<ul>
<li>Grammar:
<ul>
<li><code>rule = { term } [ ":" { constraint } ];</code>
</li>
<li><code>term = termvar | note;</code>
</li>
<li><code>termvar = variable;</code>
</li>
<li><code>note = "&lt;" height "," duration "&gt;";</code>
</li>
<li><code>height = heightval | heightvar;</code>
</li>
<li><code>heightvar = variable;</code>
</li>
<li><code>duration = durval | durvar;</code>
</li>
<li><code>durvar = variable;</code>
</li>
<li><code>constraint = [ "!" ] cname "(" variable { "," variable } ")";</code>
</li>
</ul>

</li>
<li>Instatiation:
<ul>
<li>rule is basic instance, if it contains no constraints or variables
</li>
<li>rule can be instaciated by replacing variables with values:
<ul>
<li>termvars are replaced by basic instances
</li>
<li>heightvars are replaced by heightvals
</li>
<li>durvars are replaced by durvals
</li>
</ul>

</li>
<li>same variables are replaced by the same value in one step
</li>
<li>variables in constraints are also replaced
</li>
<li>the value of constraints preceded by "!" is inverted.
</li>
<li>constraints without variables must evaluate to true
</li>
<li>true constraints can be removed
</li>
<li>note that variables may also appear <span style="text-decoration:underline;">only</span> in the <span style="text-decoration:underline;">constraints</span>!
</li>
</ul>

</li>
<li>Values:
<dl>
<dt>variable</dt><dd>arbitrary, but for notation purpose all valid C identifiers starting uppercase
</dd>
<dt>heightval</dt><dd>lets start with a pentatonic scale (+ octave): {c', d', e', g', a', c''}
</dd>
<dt>durval</dt><dd>from whole notes to 16ths, no compounds: {1, 2, 4, 8, 16}
</dd>
<dt>cname</dt><dd>denotes constraints, for example:
<ul>
<li><code>higher (x: heightval, y: heightval)</code> -&gt; <code>x</code> is higher than <code>y</code>
</li>
<li><code>next (x: heightval, y: heightval)</code> -&gt; <code>x</code> is the next higher note after <code>y</code>
</li>
<li><code>longer (x: durval, y: durval)</code> -&gt; <code>x</code> is longer than <code>y</code>
</li>
<li><code>double_length (x: durval, y: durval)</code> -&gt; <code>x</code> is twice as long as <code>y</code>
</li>
</ul>

</dd>
</dl>

</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> The "brain"</h4>
<div class="outline-text-4" id="text-2-1-2">

<ul>
<li>impro:
<ul>
<li>ideas constantly generated, refined, etc.
</li>
<li>"pulled" out by timer, requesting the currently most interesting idea
</li>
</ul>

</li>
<li>structure:
<dl>
<dt>memory</dt><dd>contains the complete set of known concepts
<ul>
<li>ideas should be somehow weighted and connected
</li>
<li>weight resembles roughly the probability to come to the <i>mind</i>
</li>
<li>weight is increased by using similar concepts, decreased by time
</li>
<li>connections are used to express
<ol>
<li>semantic connections between concepts
</li>
<li>"relatedness" between concepts
         (used for weighting, bringing stuff to the <i>mind</i>, etc.)
</li>
</ol>

</li>
</ul>

</dd>
<dt>mind</dt><dd>Contains currently most interesting concepts.
            Only concepts in the <i>mind</i> are used for thinking,
            but concepts similar to the used ones can go to the <i>mind</i>,
            if referred by <i>mind</i>-concepts.
<ul>
<li>heap structure (?)
</li>
<li>weight decreases by time and increases by use
</li>
<li>weight marks probability to be used in the next step
</li>
<li>threshold for going to <i>memory</i>
      (max. number of concepts in mind, minimum weight, &hellip;)
</li>
</ul>

</dd>
</dl>

</li>
<li>possibilities for weight calculation:
<ul>
<li>exponential moving average (alpha = ?)
<ul>
<li>0 = not used, 1 = used
</li>
<li>(1/2)<sup>k</sup> if shortest path to used concept has k edges
</li>
</ul>

</li>
</ul>

</li>
<li>thinking algorithm:
<ol>
<li>select concept from <i>mind</i> with probability (w<sub>i</sub> / sum(w<sub>i</sub>))
</li>
<li>think about concept to create a new one (depends on concept language)
</li>
<li>determine concepts related to the new concept
</li>
<li>assign y to concepts (y=0, if not related, y&gt;0 if related)
</li>
<li>calculate new weights w to concepts (exponential moving average)
</li>
<li>drop stuff with small weights from <i>mind</i> to <i>memory</i>
</li>
<li>push stuff with high weights from <i>memory</i> to <i>mind</i>
    (good idea? better approaches for <i>memory</i> -&gt; <i>mind</i>?)
</li>
</ol>

</li>
<li>relation measure
<ul>
<li>relation coefficient: [0,1], 0=unrelated, 1=identical
</li>
<li>every concept has a set of related concepts, graph with weighted edges
</li>
<li>weight of path is product of edge weights
</li>
<li>"best" path = "heaviest" path
</li>
<li>path weight used for weight calculation of concepts (weight of nodes)
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> technical stuff</h4>
<div class="outline-text-4" id="text-2-1-3">

<ul>
<li>Audio Output:
<ul>
<li>portmidi library: <a href="http://sourceforge.net/apps/trac/portmedia/wiki/portmidi">http://sourceforge.net/apps/trac/portmedia/wiki/portmidi</a>
</li>
<li>CL bindings: <a href="https://github.com/chfin/cl-portmidi">https://github.com/chfin/cl-portmidi</a>
</li>
</ul>

</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Goals</h2>
<div class="outline-text-2" id="text-3">

<p>My goal for the project is a program generating music live and continuously based on some input given by the user
</p><ul>
<li>main project goals:
<ol>
<li><code>[&nbsp;]</code> concepts for very basic model (music)
</li>
<li><code>[&nbsp;]</code> idea stream
</li>
<li><code>[&nbsp;]</code> running program
</li>
</ol>

</li>
<li>optional project goals:
<ol>
<li><code>[&nbsp;]</code> some kind of concept extraction/generation
</li>
<li><code>[&nbsp;]</code> less restricted concept model (still music)
</li>
<li><code>[&nbsp;]</code> offline composition mode
</li>
</ol>

</li>
<li>further goals:
<ol>
<li><code>[&nbsp;]</code> more general concept model
</li>
<li><code>[&nbsp;]</code> exchange with other concept databases (collaboration)
<ol>
<li><code>[&nbsp;]</code> 
</li>
</ol>

</li>
</ol>

</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-12-02 18:02:11 EET</p>
<p class="author">Author: Christoph Finkensiep</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
